{
  "singular": "Dwarf",
  "plural": "Dwarves",
  "description": "Dwarves are a stoic but stern race, ensconced in cities carved from the hearts of mountains and fiercely determined to repel the depredations of savage races like orcs and goblins. More than any other race, the dwarves have acquired a reputation as dour and humorless craftsmen of the earth. It could be said that dwarven history shapes the dark disposition of many dwarves, for they reside in high mountains and dangerous realms below the earth, constantly at war with giants, goblins, and other such horrors.",
  "physical_description": "Dwarves are a short and stocky race, and stand about a foot shorter than most humans, with wide, compact bodies that account for their burly appearance. Male and female dwarves pride themselves on the length of their hair, and men often decorate their beards with a variety of clasps and intricate braids. A cleanshaven male dwarf is a sure sign of madness, or worse—no one familiar with their race trusts a beardless dwarf.",
  "society": "The great distances between their mountain citadels account for many of the cultural differences that exist within dwarven society. Despite these schisms, dwarves throughout the world are characterized by their love of stonework, their passion for stone- and metal-based craftsmanship and architecture, and a fierce hatred of giants, orcs, and goblinoids.",
  "relations": "Dwarves and orcs have long dwelt in proximity, theirs a history of violence as old as both their races. Dwarves generally distrust and shun halforcs. They f ind half lings, elves, and gnomes to be too frail, f lighty, or “pretty” to be worthy of proper respect. It is with humans that dwarves share the strongest link, for humans’ industrious nature and hearty appetites come closest to matching those of the dwarven ideal.",
  "size": "medium",
  "racial_traits": {
    "Abilities": [
      "Dwarves are both tough and wise, but also a bit gruff",
      [
        "+2 to Constitution",
        "+2 to Wisdom",
        "-2 to Charisma"
      ]
    ],
    "Darkvision": [
      "Dwarves are well adapted to the mines and tunnels they inhabit, and can see in the dark.",
      ["Grants Darkvision"]
    ],
    "Defensive Training": [
      "Dwarves are small and fight defensively, giving them an advantage against giants.",
      ["+2 dodge bonus to AC against giant subtype"]
    ],
    "Greed": [
      "Dwarves tend to be greedy, and as such are often better at determining an object's value.",
      ["+2 racial bonus to Appraise skill checks"]
    ],
    "Hatred": [
      "Dwarves have been specially trained to fight Orcs and Goblins.",
      [
        "+1 bonus to Attack against orc subtype",
        "+1 bonus to Attack against goblinoid subtype"
      ]
    ],
    "Hardy": [
      "Dwarves have natural resistance to poisons and magic.",
      [
        "+2 racial bonus to saving throws against poison",
        "+2 racial bonus to saving throws against spells"
      ]
    ],
    "Stability": [
      "A low center of gravity and muscular legs help Dwarves resist attempts to throw them off their balance.",
      [
        "+4 racial bonus to CMD against bull rush",
        "+4 racial bonus to CMD against trip"
      ]
    ],
    "Stonecunning": [
      "Dwarves receive a +2 bonus on Perception checks to potentially notice unusual stonework, such as traps and hidden doors located in stone walls or floors. They receive a check to notice such features whenever they pass within 10 feet of them, whether or not they are actively looking.",
      []
    ],
    "Weapon Familiarity": [
      "Dwarves are proficient with battleaxes, heavy picks, and warhammers, and treat any weapon with the word 'dwarven' in its name as a martial weapon.",
      []
    ],
    "Languages": [
      "Dwarves grow up speaking Common and Dwarven",
      [
        "Speak Common",
        "Speak Dwarven"
      ]
    ]
  }
}
